# シーケンスとはなんですか？どういう概念がシーケンスでは最も大切なことですか？
# pass 

# シーケンスであれば、P160に太字で記載されている特徴を持っています。下記のシーケンスを使って確認して下さい
# s1 = [0, 1, 2, 3, 4]
# s2 = ('Aland', 'Dari', 'Lorelle', 'Debbie', 'Jermaine', 'Royal', 'Tiena')
# s3 = "ABCDE"

# pass 


# 変換可能と変換不可能について説明して下さい
# pass 

# python の型のなかで変換可能と変換不可能な型に分けてください。
# pass 

# 破壊的操作とはなんですか？
# pass 

# P161 のset型とディクショナリ型の説明で、「変換不可能なデータを要素として持つ」と書いてあります。これを確認するために以下をインタプリタで確認してみて下さい。2つともエラーが返ってくるとおもいます。どういうエラーですか？エラーの意味を答えて下さい。
# pass 

# 一方、下記は問題なく実行できたと思います。理由を答えて下さい。
# pass 

